Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortWarn Property
 AdjustEdge is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AdjustEdgeTooShortWarn { get; }
Visual Basic
Public Shared ReadOnly Property AdjustEdgeTooShortWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AdjustEdgeTooShortWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace